In [2]:
import pandas as pd
df_credit = pd.read_csv('https://www.littledataman.com/samples/credit.csv', parse_dates = ['Approval Date'])
df_cards = pd.read_csv('https://www.littledataman.com/samples/cards.csv', parse_dates = ['Effective Date'])
df_trans = pd.read_csv('https://www.littledataman.com/samples/transactions.csv', parse_dates = ['Date'])

In [7]:
import numpy as np

In [4]:
df_trans

  Card Number       Date  Transactions  Amount
0       CN012 2019-09-01             2  356.20
1       CN014 2019-09-01             3  120.50
2       CN015 2019-09-01             1   53.23
3       CN016 2019-09-01             3   25.60
4       CN012 2019-09-02             5  785.00
5       CN015 2019-09-02             2   23.12
6       CN016 2019-09-02             3   28.30
7       CN012 2019-09-03             4   36.90
8       CN014 2019-09-03             2   23.60
9       CN016 2019-09-03             4   43.50

In [5]:
df_trans.groupby('Card Number')['Amount', 'Transactions'].sum()

              Amount  Transactions
Card Number
CN012        1178.10            11
CN014         144.10             5
CN015          76.35             3
CN016          97.40            10

In [9]:
df_trans.groupby('Card Number')['Amount', 'Transactions'].agg([np.sum, np.mean, np.std])

              Amount                         Transactions
                 sum        mean         std          sum      mean       std
Card Number
CN012        1178.10  392.700000  375.383257           11  3.666667  1.527525
CN014         144.10   72.050000   68.518647            5  2.500000  0.707107
CN015          76.35   38.175000   21.290985            3  1.500000  0.707107
CN016          97.40   32.466667    9.650043           10  3.333333  0.577350

In [10]:
df_trans.groupby('Card Number').agg({'Transactions':['min', 'max'], 'Amount':
'mean'})

            Transactions          Amount
                     min max        mean
Card Number
CN012                  2   5  392.700000
CN014                  2   3   72.050000
CN015                  1   2   38.175000
CN016                  3   4   32.466667

In [11]:
def mean_plus_std(x):
    return x.mean() + 1.96 * x.std()
df_trans.groupby('Card Number')['Transactions','Amount'].apply(mean_plus_std)

             Transactions       Amount
Card Number
CN012            6.660616  1128.451185
CN014            3.885929   206.346548
CN015            2.885929    79.905331
CN016            4.464940    51.380751